<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

# Final Project: Data Analysis using Spark

Estimated time needed: **60** minutes

This final project is similar to the Practice Project you did. In this project, you will not be provided with hints or solutions. You will create a DataFrame by loading data from a CSV file and apply transformations and actions using Spark SQL. This needs to be achieved by performing the following tasks:

- Task 1: Generate DataFrame from CSV data.
- Task 2: Define a schema for the data.
- Task 3: Display schema of DataFrame.
- Task 4: Create a temporary view.
- Task 5: Execute an SQL query.
- Task 6: Calculate Average Salary by Department.
- Task 7: Filter and Display IT Department Employees.
- Task 8: Add 10% Bonus to Salaries.
- Task 9: Find Maximum Salary by Age.
- Task 10: Self-Join on Employee Data.
- Task 11: Calculate Average Employee Age.
- Task 12: Calculate Total Salary by Department.
- Task 13: Sort Data by Age and Salary.
- Task 14: Count Employees in Each Department.
- Task 15: Filter Employees with the letter o in the Name.

### Prerequisites 

1. For this lab assignment, you will be using Python and Spark (PySpark). Therefore, it's essential to make sure that the following libraries are installed in your lab environment or within Skills Network (SN) Labs

In [1]:
# Installing required packages  

!pip install pyspark  findspark wget

Collecting pyspark
  Downloading pyspark-3.4.3.tar.gz (311.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 311.4/311.4 MB 1.6 MB/s eta 0:00:0000:0100:01
  Preparing metadata (setup.py) ... done
Collecting findspark
  Downloading findspark-2.0.1-py2.py3-none-any.whl (4.4 kB)
Requirement already satisfied: wget in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (3.2)
Collecting py4j==0.10.9.7 (from pyspark)
  Downloading py4j-0.10.9.7-py2.py3-none-any.whl (200 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 200.5/200.5 kB 26.3 MB/s eta 0:00:00
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.4.3-py2.py3-none-any.whl size=311885504 sha256=953224f67876c8bd51697bc046995b3e18b245e3acf72d85511967bbb89bb875
  Stored in directory: /home/jupyterlab/.cache/pip/wheels/37/bc/bb/77785f6fcd2c83e663647f73225b76f3a3d5fd00762d7daf6f
Successfully built pyspark
Installing collected packages: py4j, findspark, pyspark
Successfully installed findspark-2.0.1 py4j-0.10.9.7 pyspark-3.4.3

In [3]:
import findspark

findspark.init()

In [4]:
# PySpark is the Spark API for Python. In this lab, we use PySpark to initialize the SparkContext.   

from pyspark import SparkContext, SparkConf

from pyspark.sql import SparkSession

In [5]:
# Creating a SparkContext object  

sc = SparkContext.getOrCreate()

# Creating a SparkSession  

spark = SparkSession \
    .builder \
    .appName("Python Spark DataFrames basic example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

24/07/29 13:27:25 WARN util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

2. Download the CSV data.

In [6]:
# Download the CSV data first into a local `employees.csv` file
import wget
wget.download("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-BD0225EN-SkillsNetwork/data/employees.csv")

'employees.csv'

### Tasks

#### Task 1: Generate a Spark DataFrame from the CSV data

Read data from the provided CSV file, `employees.csv` and import it into a Spark DataFrame variable named `employees_df`.

In [10]:
# Read data from the "emp" CSV file and import it into a DataFrame variable named "employees_df"  
csv_file = 'employees.csv'
# Load the JSON file into a PySpark DataFrame
employees_df = spark.read.csv(csv_file, header=True, inferSchema=True)

In [11]:
employees_df.show()

+------+---------+------+---+----------+
|Emp_No| Emp_Name|Salary|Age|Department|
+------+---------+------+---+----------+
|   198|   Donald|  2600| 29|        IT|
|   199|  Douglas|  2600| 34|     Sales|
|   200| Jennifer|  4400| 36| Marketing|
|   201|  Michael| 13000| 32|        IT|
|   202|      Pat|  6000| 39|        HR|
|   203|    Susan|  6500| 36| Marketing|
|   204|  Hermann| 10000| 29|   Finance|
|   205|  Shelley| 12008| 33|   Finance|
|   206|  William|  8300| 37|        IT|
|   100|   Steven| 24000| 39|        IT|
|   101|    Neena| 17000| 27|     Sales|
|   102|      Lex| 17000| 37| Marketing|
|   103|Alexander|  9000| 39| Marketing|
|   104|    Bruce|  6000| 38|        IT|
|   105|    David|  4800| 39|        IT|
|   106|    Valli|  4800| 38|     Sales|
|   107|    Diana|  4200| 35|     Sales|
|   108|    Nancy| 12008| 28|     Sales|
|   109|   Daniel|  9000| 35|        HR|
|   110|     John|  8200| 31| Marketing|
+------+---------+------+---+----------+
only showing top 20 rows

#### Task 2: Define a schema for the data

Construct a schema for the input data and then utilize the defined schema to read the CSV file to create a DataFrame named `employees_df`.

In [ ]:
# Define a Schema for the input data and read the file using the user-defined Schema

#### Task 3: Display schema of DataFrame

Display the schema of the `employees_df` DataFrame, showing all columns and their respective data types.

In [12]:
# Display all columns of the DataFrame, along with their respective data types
employees_df.printSchema()

root
 |-- Emp_No: integer (nullable = true)
 |-- Emp_Name: string (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Department: string (nullable = true)

#### Task 4: Create a temporary view

Create a temporary view named `employees` for the `employees_df` DataFrame, enabling Spark SQL queries on the data.

In [13]:
# Create a temporary view named "employees" for the DataFrame
employees_df.createOrReplaceTempView("employees")

#### Task 5: Execute an SQL query

Compose and execute an SQL query to fetch the records from the `employees` view where the age of employees exceeds 30. Then, display the result of the SQL query, showcasing the filtered records.

In [18]:
# SQL query to fetch solely the records from the View where the age exceeds 30
aaa = spark.sql('select * from employees where Age >30')
aaa.show()

+------+-----------+------+---+----------+
|Emp_No|   Emp_Name|Salary|Age|Department|
+------+-----------+------+---+----------+
|   199|    Douglas|  2600| 34|     Sales|
|   200|   Jennifer|  4400| 36| Marketing|
|   201|    Michael| 13000| 32|        IT|
|   202|        Pat|  6000| 39|        HR|
|   203|      Susan|  6500| 36| Marketing|
|   205|    Shelley| 12008| 33|   Finance|
|   206|    William|  8300| 37|        IT|
|   100|     Steven| 24000| 39|        IT|
|   102|        Lex| 17000| 37| Marketing|
|   103|  Alexander|  9000| 39| Marketing|
|   104|      Bruce|  6000| 38|        IT|
|   105|      David|  4800| 39|        IT|
|   106|      Valli|  4800| 38|     Sales|
|   107|      Diana|  4200| 35|     Sales|
|   109|     Daniel|  9000| 35|        HR|
|   110|       John|  8200| 31| Marketing|
|   111|     Ismael|  7700| 32|        IT|
|   112|Jose Manuel|  7800| 34|        HR|
|   113|       Luis|  6900| 34|     Sales|
|   116|     Shelli|  2900| 37|   Finance|
+------+-----------+------+---+----------+
only showing top 20 rows

#### Task 6: Calculate Average Salary by Department

Compose an SQL query to retrieve the average salary of employees grouped by department. Display the result.

In [19]:
# SQL query to calculate the average salary of employees grouped by department
bbb = spark.sql('select avg(Salary),Department from employees group by Department')
bbb.show()

[Stage 15:==============================================>        (64 + 11) / 75]

+-----------------+----------+
|      avg(Salary)|Department|
+-----------------+----------+
|5492.923076923077|     Sales|
|           5837.5|        HR|
|           5730.8|   Finance|
|6633.333333333333| Marketing|
|           7400.0|        IT|
+-----------------+----------+

#### Task 7: Filter and Display IT Department Employees

Apply a filter on the `employees_df` DataFrame to select records where the department is `'IT'`. Display the filtered DataFrame.

In [28]:
# Apply a filter to select records where the department is 'IT'
ccc = spark.sql('select * from employees where Department = "IT" ')
ccc.show()

+------+--------+------+---+----------+
|Emp_No|Emp_Name|Salary|Age|Department|
+------+--------+------+---+----------+
|   198|  Donald|  2600| 29|        IT|
|   201| Michael| 13000| 32|        IT|
|   206| William|  8300| 37|        IT|
|   100|  Steven| 24000| 39|        IT|
|   104|   Bruce|  6000| 38|        IT|
|   105|   David|  4800| 39|        IT|
|   111|  Ismael|  7700| 32|        IT|
|   129|   Laura|  3300| 38|        IT|
|   132|      TJ|  2100| 34|        IT|
|   136|   Hazel|  2200| 29|        IT|
+------+--------+------+---+----------+

#### Task 8: Add 10% Bonus to Salaries

Perform a transformation to add a new column named "SalaryAfterBonus" to the DataFrame. Calculate the new salary by adding a 10% bonus to each employee's salary.

In [31]:
from pyspark.sql.functions import col

# Add a new column "SalaryAfterBonus" with 10% bonus added to the original salary
employees_df = employees_df.withColumn("SalaryAfterBonus", col("Salary")*1.1)
employees_df.show()

+------+---------+------+---+----------+------------------+
|Emp_No| Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+---------+------+---+----------+------------------+
|   198|   Donald|  2600| 29|        IT|2860.0000000000005|
|   199|  Douglas|  2600| 34|     Sales|2860.0000000000005|
|   200| Jennifer|  4400| 36| Marketing|            4840.0|
|   201|  Michael| 13000| 32|        IT|14300.000000000002|
|   202|      Pat|  6000| 39|        HR| 6600.000000000001|
|   203|    Susan|  6500| 36| Marketing| 7150.000000000001|
|   204|  Hermann| 10000| 29|   Finance|           11000.0|
|   205|  Shelley| 12008| 33|   Finance|13208.800000000001|
|   206|  William|  8300| 37|        IT|            9130.0|
|   100|   Steven| 24000| 39|        IT|26400.000000000004|
|   101|    Neena| 17000| 27|     Sales|           18700.0|
|   102|      Lex| 17000| 37| Marketing|           18700.0|
|   103|Alexander|  9000| 39| Marketing|            9900.0|
|   104|    Bruce|  6000| 38|        IT| 6600.000000000001|
|   105|    David|  4800| 39|        IT|            5280.0|
|   106|    Valli|  4800| 38|     Sales|            5280.0|
|   107|    Diana|  4200| 35|     Sales|            4620.0|
|   108|    Nancy| 12008| 28|     Sales|13208.800000000001|
|   109|   Daniel|  9000| 35|        HR|            9900.0|
|   110|     John|  8200| 31| Marketing|            9020.0|
+------+---------+------+---+----------+------------------+
only showing top 20 rows

#### Task 9: Find Maximum Salary by Age

Group the data by age and calculate the maximum salary for each age group. Display the result.

In [36]:
from pyspark.sql.functions import max

# Group data by age and calculate the maximum salary for each age group
eee = employees_df.groupby("age").agg(max("Salary"))
eee.show()

[Stage 27:====================================================>   (70 + 5) / 75]

+---+-----------+
|age|max(Salary)|
+---+-----------+
| 31|       8200|
| 34|       7800|
| 28|      12008|
| 27|      17000|
| 26|       3600|
| 37|      17000|
| 35|       9000|
| 39|      24000|
| 38|       6000|
| 29|      10000|
| 32|      13000|
| 33|      12008|
| 30|       8000|
| 36|       7900|
+---+-----------+

#### Task 10: Self-Join on Employee Data

Join the "employees_df" DataFrame with itself based on the "Emp_No" column. Display the result.

In [37]:
# Join the DataFrame with itself based on the "Emp_No" column
joined_df = employees_df.join(employees_df, employees_df["Emp_No"] == employees_df["Emp_No"], how="inner")
joined_df.show()

24/07/29 14:02:36 WARN sql.Column: Constructing trivially true equals predicate, 'Emp_No#51 = Emp_No#51'. Perhaps you need to use aliases.

+------+---------+------+---+----------+------------------+------+---------+------+---+----------+------------------+
|Emp_No| Emp_Name|Salary|Age|Department|  SalaryAfterBonus|Emp_No| Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+---------+------+---+----------+------------------+------+---------+------+---+----------+------------------+
|   198|   Donald|  2600| 29|        IT|2860.0000000000005|   198|   Donald|  2600| 29|        IT|2860.0000000000005|
|   199|  Douglas|  2600| 34|     Sales|2860.0000000000005|   199|  Douglas|  2600| 34|     Sales|2860.0000000000005|
|   200| Jennifer|  4400| 36| Marketing|            4840.0|   200| Jennifer|  4400| 36| Marketing|            4840.0|
|   201|  Michael| 13000| 32|        IT|14300.000000000002|   201|  Michael| 13000| 32|        IT|14300.000000000002|
|   202|      Pat|  6000| 39|        HR| 6600.000000000001|   202|      Pat|  6000| 39|        HR| 6600.000000000001|
|   203|    Susan|  6500| 36| Marketing| 7150.000000000001|   203|    Susan|  6500| 36| Marketing| 7150.000000000001|
|   204|  Hermann| 10000| 29|   Finance|           11000.0|   204|  Hermann| 10000| 29|   Finance|           11000.0|
|   205|  Shelley| 12008| 33|   Finance|13208.800000000001|   205|  Shelley| 12008| 33|   Finance|13208.800000000001|
|   206|  William|  8300| 37|        IT|            9130.0|   206|  William|  8300| 37|        IT|            9130.0|
|   100|   Steven| 24000| 39|        IT|26400.000000000004|   100|   Steven| 24000| 39|        IT|26400.000000000004|
|   101|    Neena| 17000| 27|     Sales|           18700.0|   101|    Neena| 17000| 27|     Sales|           18700.0|
|   102|      Lex| 17000| 37| Marketing|           18700.0|   102|      Lex| 17000| 37| Marketing|           18700.0|
|   103|Alexander|  9000| 39| Marketing|            9900.0|   103|Alexander|  9000| 39| Marketing|            9900.0|
|   104|    Bruce|  6000| 38|        IT| 6600.000000000001|   104|    Bruce|  6000| 38|        IT| 6600.000000000001|
|   105|    David|  4800| 39|        IT|            5280.0|   105|    David|  4800| 39|        IT|            5280.0|
|   106|    Valli|  4800| 38|     Sales|            5280.0|   106|    Valli|  4800| 38|     Sales|            5280.0|
|   107|    Diana|  4200| 35|     Sales|            4620.0|   107|    Diana|  4200| 35|     Sales|            4620.0|
|   108|    Nancy| 12008| 28|     Sales|13208.800000000001|   108|    Nancy| 12008| 28|     Sales|13208.800000000001|
|   109|   Daniel|  9000| 35|        HR|            9900.0|   109|   Daniel|  9000| 35|        HR|            9900.0|
|   110|     John|  8200| 31| Marketing|            9020.0|   110|     John|  8200| 31| Marketing|            9020.0|
+------+---------+------+---+----------+------------------+------+---------+------+---+----------+------------------+
only showing top 20 rows

#### Task 11: Calculate Average Employee Age

Calculate the average age of employees using the built-in aggregation function. Display the result.

In [39]:
# Calculate the average age of employees
from pyspark.sql.functions import avg 
employees_df.select(avg(col("age"))).show()
#eee.show()

+--------+
|avg(age)|
+--------+
|   33.56|
+--------+

#### Task 12: Calculate Total Salary by Department

Calculate the total salary for each department using the built-in aggregation function. Display the result.

In [42]:
# Calculate the total salary for each department. Hint - User GroupBy and Aggregate functions
from pyspark.sql.functions import sum 
employees_df.groupby('Department').agg(sum("Salary")).show()

+----------+-----------+
|Department|sum(Salary)|
+----------+-----------+
|     Sales|      71408|
|        HR|      46700|
|   Finance|      57308|
| Marketing|      59700|
|        IT|      74000|
+----------+-----------+

#### Task 13: Sort Data by Age and Salary

Apply a transformation to sort the DataFrame by age in ascending order and then by salary in descending order. Display the sorted DataFrame.

In [48]:
# Sort the DataFrame by age in ascending order and then by salary in descending order

employees_df.sort('Age','Salary', ascending=[True,False]).collect()

[Row(Emp_No=137, Emp_Name='Renske', Salary=3600, Age=26, Department='Marketing', SalaryAfterBonus=3960.0000000000005),
 Row(Emp_No=101, Emp_Name='Neena', Salary=17000, Age=27, Department='Sales', SalaryAfterBonus=18700.0),
 Row(Emp_No=114, Emp_Name='Den', Salary=11000, Age=27, Department='Finance', SalaryAfterBonus=12100.000000000002),
 Row(Emp_No=108, Emp_Name='Nancy', Salary=12008, Age=28, Department='Sales', SalaryAfterBonus=13208.800000000001),
 Row(Emp_No=130, Emp_Name='Mozhe', Salary=2800, Age=28, Department='Marketing', SalaryAfterBonus=3080.0000000000005),
 Row(Emp_No=126, Emp_Name='Irene', Salary=2700, Age=28, Department='HR', SalaryAfterBonus=2970.0000000000005),
 Row(Emp_No=204, Emp_Name='Hermann', Salary=10000, Age=29, Department='Finance', SalaryAfterBonus=11000.0),
 Row(Emp_No=115, Emp_Name='Alexander', Salary=3100, Age=29, Department='Finance', SalaryAfterBonus=3410.0000000000005),
 Row(Emp_No=134, Emp_Name='Michael', Salary=2900, Age=29, Department='Sales', SalaryAfterBonus=3190.0000000000005),
 Row(Emp_No=198, Emp_Name='Donald', Salary=2600, Age=29, Department='IT', SalaryAfterBonus=2860.0000000000005),
 Row(Emp_No=140, Emp_Name='Joshua', Salary=2500, Age=29, Department='Finance', SalaryAfterBonus=2750.0),
 Row(Emp_No=136, Emp_Name='Hazel', Salary=2200, Age=29, Department='IT', SalaryAfterBonus=2420.0),
 Row(Emp_No=120, Emp_Name='Matthew', Salary=8000, Age=30, Department='HR', SalaryAfterBonus=8800.0),
 Row(Emp_No=110, Emp_Name='John', Salary=8200, Age=31, Department='Marketing', SalaryAfterBonus=9020.0),
 Row(Emp_No=127, Emp_Name='James', Salary=2400, Age=31, Department='HR', SalaryAfterBonus=2640.0),
 Row(Emp_No=201, Emp_Name='Michael', Salary=13000, Age=32, Department='IT', SalaryAfterBonus=14300.000000000002),
 Row(Emp_No=111, Emp_Name='Ismael', Salary=7700, Age=32, Department='IT', SalaryAfterBonus=8470.0),
 Row(Emp_No=119, Emp_Name='Karen', Salary=2500, Age=32, Department='Finance', SalaryAfterBonus=2750.0),
 Row(Emp_No=205, Emp_Name='Shelley', Salary=12008, Age=33, Department='Finance', SalaryAfterBonus=13208.800000000001),
 Row(Emp_No=124, Emp_Name='Kevin', Salary=5800, Age=33, Department='Marketing', SalaryAfterBonus=6380.000000000001),
 Row(Emp_No=117, Emp_Name='Sigal', Salary=2800, Age=33, Department='Sales', SalaryAfterBonus=3080.0000000000005),
 Row(Emp_No=128, Emp_Name='Steven', Salary=2200, Age=33, Department='Finance', SalaryAfterBonus=2420.0),
 Row(Emp_No=112, Emp_Name='Jose Manuel', Salary=7800, Age=34, Department='HR', SalaryAfterBonus=8580.0),
 Row(Emp_No=113, Emp_Name='Luis', Salary=6900, Age=34, Department='Sales', SalaryAfterBonus=7590.000000000001),
 Row(Emp_No=199, Emp_Name='Douglas', Salary=2600, Age=34, Department='Sales', SalaryAfterBonus=2860.0000000000005),
 Row(Emp_No=132, Emp_Name='TJ', Salary=2100, Age=34, Department='IT', SalaryAfterBonus=2310.0),
 Row(Emp_No=109, Emp_Name='Daniel', Salary=9000, Age=35, Department='HR', SalaryAfterBonus=9900.0),
 Row(Emp_No=123, Emp_Name='Shanta', Salary=6500, Age=35, Department='Sales', SalaryAfterBonus=7150.000000000001),
 Row(Emp_No=107, Emp_Name='Diana', Salary=4200, Age=35, Department='Sales', SalaryAfterBonus=4620.0),
 Row(Emp_No=125, Emp_Name='Julia', Salary=3200, Age=35, Department='Finance', SalaryAfterBonus=3520.0000000000005),
 Row(Emp_No=138, Emp_Name='Stephen', Salary=3200, Age=35, Department='Sales', SalaryAfterBonus=3520.0000000000005),
 Row(Emp_No=135, Emp_Name='Ki', Salary=2400, Age=35, Department='Marketing', SalaryAfterBonus=2640.0),
 Row(Emp_No=122, Emp_Name='Payam', Salary=7900, Age=36, Department='Finance', SalaryAfterBonus=8690.0),
 Row(Emp_No=203, Emp_Name='Susan', Salary=6500, Age=36, Department='Marketing', SalaryAfterBonus=7150.000000000001),
 Row(Emp_No=200, Emp_Name='Jennifer', Salary=4400, Age=36, Department='Marketing', SalaryAfterBonus=4840.0),
 Row(Emp_No=139, Emp_Name='John', Salary=2700, Age=36, Department='Sales', SalaryAfterBonus=2970.0000000000005),
 Row(Emp_No=118, Emp_Name='Guy', Salary=2600, Age=36, Department='HR', SalaryAfterBonus=2860.0000000000005),
 Row(Emp_No=131, Emp_Name='James', Salary=2500, Age=36, Department='Sales', SalaryAfterBonus=2750.0),
 Row(Emp_No=102, Emp_Name='Lex', Salary=17000, Age=37, Department='Marketing', SalaryAfterBonus=18700.0),
 Row(Emp_No=206, Emp_Name='William', Salary=8300, Age=37, Department='IT', SalaryAfterBonus=9130.0),
 Row(Emp_No=116, Emp_Name='Shelli', Salary=2900, Age=37, Department='Finance', SalaryAfterBonus=3190.0000000000005),
 Row(Emp_No=104, Emp_Name='Bruce', Salary=6000, Age=38, Department='IT', SalaryAfterBonus=6600.000000000001),
 Row(Emp_No=106, Emp_Name='Valli', Salary=4800, Age=38, Department='Sales', SalaryAfterBonus=5280.0),
 Row(Emp_No=129, Emp_Name='Laura', Salary=3300, Age=38, Department='IT', SalaryAfterBonus=3630.0000000000005),
 Row(Emp_No=133, Emp_Name='Jason', Salary=3300, Age=38, Department='Sales', SalaryAfterBonus=3630.0000000000005),
 Row(Emp_No=100, Emp_Name='Steven', Salary=24000, Age=39, Department='IT', SalaryAfterBonus=26400.000000000004),
 Row(Emp_No=103, Emp_Name='Alexander', Salary=9000, Age=39, Department='Marketing', SalaryAfterBonus=9900.0),
 Row(Emp_No=121, Emp_Name='Adam', Salary=8200, Age=39, Department='HR', SalaryAfterBonus=9020.0),
 Row(Emp_No=202, Emp_Name='Pat', Salary=6000, Age=39, Department='HR', SalaryAfterBonus=6600.000000000001),
 Row(Emp_No=105, Emp_Name='David', Salary=4800, Age=39, Department='IT', SalaryAfterBonus=5280.0)]

#### Task 14: Count Employees in Each Department

Calculate the number of employees in each department. Display the result.

In [49]:
from pyspark.sql.functions import count

# Calculate the number of employees in each department
employees_df.groupby('Department').agg(count('Emp_No')).show()

+----------+-------------+
|Department|count(Emp_No)|
+----------+-------------+
|     Sales|           13|
|        HR|            8|
|   Finance|           10|
| Marketing|            9|
|        IT|           10|
+----------+-------------+

#### Task 15: Filter Employees with the letter o in the Name

Apply a filter to select records where the employee's name contains the letter `'o'`. Display the filtered DataFrame.

In [50]:
# Apply a filter to select records where the employee's name contains the letter 'o'
employees_df.filter(employees_df['Emp_Name'].contains('o') ).show()

+------+-----------+------+---+----------+------------------+
|Emp_No|   Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+-----------+------+---+----------+------------------+
|   198|     Donald|  2600| 29|        IT|2860.0000000000005|
|   199|    Douglas|  2600| 34|     Sales|2860.0000000000005|
|   110|       John|  8200| 31| Marketing|            9020.0|
|   112|Jose Manuel|  7800| 34|        HR|            8580.0|
|   130|      Mozhe|  2800| 28| Marketing|3080.0000000000005|
|   133|      Jason|  3300| 38|     Sales|3630.0000000000005|
|   139|       John|  2700| 36|     Sales|2970.0000000000005|
|   140|     Joshua|  2500| 29|   Finance|            2750.0|
+------+-----------+------+---+----------+------------------+

# Congratulations! You have completed the project.

Now you know how to create a DataFrame from a CSV data file and perform a variety of DataFrame transformations and actions using Spark SQL.

## Authors

Raghul Ramesh

Lavanya T S

<!--## Change Log -->

<!--|Date (YYYY-MM-DD)|Version|Changed By|Change Description|
|-|-|-|-|
|2023-09-01|0.1|Lavanya T S|Initial version|
|2023-09-11|0.2|Pornima More|QA pass with edits|-->

<h3 align="center"> &#169; IBM Corporation. All rights reserved. <h3/>